// 4. Напишите функцию с интерфейсом в старом стиле, которая имеет следующий прототип:
int reduce(long ar[], int n);
// Действительными аргументами должны быть имя массива и количеством элементов в нем.
// Функция должна сортировать массив, удалять дублированные значения и возвращать значение, 
// равное числу элементов в уменьшенном массиве.Напишите эту функцию, используя функции STL.
// (Если вы решите применить общую функцию unique(), обратите внимание, 
// что она возвращает конец результирующего диапазона.)
// Протестируйте эту функцию в короткой программе.