// 5. Мэт (Mat) и Пэт (Pat) хотят пригласить своих друзей на вечеринку - почти так 
// же, как они это делали в упражнении 8 из главы 16, за исключением того, что 
// теперь им нужна программа, использующая файлы. Они просят вас написать 
// программу, которая должна выполнпть перечисленные ниже действия. 
// • Считывать список друзей Мэта из текстового файла ma t.dat, 
// в котором в каждой строке указан один друг. Имена сохраняются 
// в контейнере и затем отображаются в отсортированном виде. 
// • Считывать список друзей Пэт из текстового файла ра t.dat, 
// в котором в каждой строке указан один друг. 
// Имена сохраняются в контейнере и затем отображаются в отсортированном виде. 
// • Объединить эти два списка, исключая дубликаты, и сохранить результат в 
// файле matnpat.dat, по одному другу в строке.