// 4. Напишите программу, которая открывает два текстовых файла для ввода и 
// один для вывода. Программа должна соединять соответствующие строки входных файлов, 
// используя в качестве разделителя пробел, и записывать результаты в выходной файл. 
// Если один файл короче второго, остальные строки более 
// длинного файла также должны копироваться в выходной файл. 
// Например, предположим, что первый входной файл имеет следующее содержимое: 
eggs kites donuts 
balloons hammers 
stones 
// А второй файл - такое: 
zero lassitude 
finance drama 
// Результирующий файл должен выглядеть следующим образом: 
eggs kites donuts zero lassitude 
balloons hammers finance drama 
stones